In [2]:
import pandas as pd

In [4]:
df = pd.read_excel("NamesAndAges.xlsx")
df

     Names  Age
0    ahmed   21
1  mohamed   19
2    malik   17
3   khaled   20
4     rami   30
5    marko   25

In [6]:
maxx = df['Age'].quantile(0.95)
maxx

28.75

In [7]:
df[df['Age']>maxx]

  Names  Age
4  rami   30

In [9]:
minn = df['Age'].quantile(0.05)
minn

17.5

In [11]:
df[df['Age']<minn]

   Names  Age
2  malik   17

In [12]:
df[(df['Age']<maxx) &(df['Age']>minn)]

     Names  Age
0    ahmed   21
1  mohamed   19
3   khaled   20
5    marko   25